# InvalidCropAreaSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidCropAreaSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
Crop area sketch can either be empty or include one closed, not self-intersecting loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidCropAreaSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidCropAreaSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidCropAreaSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace